auth/app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def authenticate_request
    if session[:user_id].present?
      @current_user = User.find(session[:user_id])